app/controllers/books_controller.rb

 def index
    @current_user = User.find(session[:user_id])
    @books = Book.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
SELECT `books`.* FROM `books`

 def show
    @current_user = User.find(session[:user_id])
    @book = Book.find(params[:id])
    @issued_books = IssuedBook.find_by(book_id: @book.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1  [["id", 4], ["LIMIT", 1]]
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT  `issued_books`.* FROM `issued_books` WHERE `issued_books`.`book_id` = 4 LIMIT 1

 def create
   @book = Book.new(book_params)
   if @book.save
---
INSERT INTO `books` (`book_name`, `desc`, `created_at`, `updated_at`) VALUES ('Programming Ruby', 'This is a computer programming book written by Brian Kernighan and Dennis Ritchie.', '2021-09-07 10:46:53', '2021-09-07 10:46:53')

 def borrow
  @book = Book.find(params[:id])
  @book.is_borrowed = true
  @book.user_id = session[:user_id]
  @issued_book = IssuedBook.find_by(book_id: @book.id)
  logger.info("---------------#{@book.save!}--------------")
  if @book.save!
  logger.info(@issued_book.issue_date)
  @issued_book.update(issue_date: DateTime.now)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT  `issued_books`.* FROM `issued_books` WHERE `issued_books`.`book_id` = 1 LIMIT 1
UPDATE `books` SET `is_borrowed` = TRUE, `user_id` = 4, `updated_at` = '2021-09-08 16:38:51' WHERE `books`.`id` = 3
UPDATE `books` SET `is_borrowed` = TRUE, `user_id` = 4, `updated_at` = '2021-09-07 06:28:08' WHERE `books`.`id` = 3
UPDATE `books` SET `is_borrowed` = TRUE, `user_id` = 4, `updated_at` = '2021-09-07 11:48:47' WHERE `books`.`id` = 1

  def return
    @book=Book.find(params[:id])
    @book.return = true
    @current_user = User.find(session[:user_id])
    @issued_books = IssuedBook.find_by(book_id: @book.id)



    if @book.is_borrowed && (@book.user_id != Current.user.id)
      invalid_return = true
    end

    @book.is_borrowed=false
    @book.user_id = nil
    if !invalid_return && @book.save!
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1  [["id", 4], ["LIMIT", 1]]
SELECT  `issued_books`.* FROM `issued_books` WHERE `issued_books`.`book_id` = 3 LIMIT 1
UPDATE `books` SET `is_borrowed` = FALSE, `user_id` = NULL, `updated_at` = '2021-09-08 16:38:47' WHERE `books`.`id` = 3

 def update
   @book = Book.find(params[:id])
   if @book.update_attributes(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `book_name` = 'The C Programming Language . ', `updated_at` = '2021-08-28 11:26:12' WHERE `books`.`id` = 1

 def destroy
   @book = Book.find(params[:id])
   if @book.delete
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 5