app/controllers/registrations_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('poojabhore@gmail.com', '$2a$12$kqgxmWOADMMbpRUHI7.y6OBTNzA/abRbXCr58jbFmf8bZ59VUeoBu', '2021-08-27 06:31:22', '2021-08-27 06:31:22')
---
    def create
       @user = User.new(user_params)
       if @user.save