app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'poojabhore123@gmail.com' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`type` IS NULL LIMIT 1
---
    def create

        user = User.find_by(email: params[:email])
        if user.present? && user.authenticate(params[:password])